Q1. List any five function of the pandas library with execution.

In [1]:
#1.head() it used to get the first five data frame

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("players.csv")

In [4]:
df.head()

      Western Conference   W   L   W/L%   GB   PS/G   PA/G   SRS
0        Denver Nuggets*  53  29  0.646    —  115.8  112.5  3.04
1     Memphis Grizzlies*  51  31  0.622  2.0  116.9  113.0  3.60
2      Sacramento Kings*  48  34  0.585  5.0  120.7  118.1  2.30
3          Phoenix Suns*  45  37  0.549  8.0  113.6  111.6  2.08
4  Los Angeles Clippers*  44  38  0.537  9.0  113.6  113.1  0.31

In [5]:
#2.tail() it is used to get the last five data frame
df.tail()

        Western Conference   W   L   W/L%    GB   PS/G   PA/G   SRS
10        Dallas Mavericks  38  44  0.463  15.0  114.2  114.1 -0.14
11               Utah Jazz  37  45  0.451  16.0  117.1  118.0 -1.03
12  Portland Trail Blazers  33  49  0.402  20.0  113.4  117.4 -3.96
13         Houston Rockets  22  60  0.268  31.0  110.7  118.6 -7.62
14       San Antonio Spurs  22  60  0.268  31.0  113.0  123.1 -9.82

Q2. Given a Pandas DataFrame df with columns 'A','B', and 'c' write a python fuction to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [6]:
import pandas as pd
data={
    "A":[1,2,3,4],
    "B":[5,6,7,8],
    "C":[9,10,11,12]
}
df1=pd.DataFrame(data)
df1

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [7]:
def reindex(df):
    new_index=range(1,len(df)*2,2)
    df.index=new_index
    return df

In [8]:
reindex(df1)

   A  B   C
1  1  5   9
3  2  6  10
5  3  7  11
7  4  8  12

Q3. You have a Pandas DataFrame df with column named "Values". Write a python function that iterates over the DataFrame and calculates the sum of the first three in the 'values' column. The function should print the sum to the console.

In [9]:
import pandas as pd 
v=[10,20,30,40,50]
df2=pd.DataFrame(v,columns=["values"])
df2

   values
0      10
1      20
2      30
3      40
4      50

In [10]:
def add(data):
    a=list(data["values"])
    sum_of_values=0
    for i in range(3):
        sum_of_values+=a[i]
    return sum_of_values

In [11]:
add(df2)

60

Q4. Given a pandas DataFrame df with a column 'Text'. Write a python function to create a new column 'Word_count' that contains the number of words in each row of the 'Text' column.

In [12]:
import pandas as pd
q1=["vishal","sumit","simran","ritu"]
df3=pd.DataFrame(q1,columns=['Text'])
df3

     Text
0  vishal
1   sumit
2  simran
3    ritu

In [13]:
df3["word_count"]=df3["Text"].apply(lambda x : len(x.split()))

In [14]:
df3

     Text  word_count
0  vishal           1
1   sumit           1
2  simran           1
3    ritu           1

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [15]:
# DataFrame.size return the total number of row multiplied by the total number of columns


import pandas as pd
data={
    "A":[1,2,3,4],
    "B":[5,6,7,8],
    "C":[9,10,11,12]
}
df4=pd.DataFrame(data)
df4

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [25]:
df4.size # this will return the mutliplication of row and columns

12

In [27]:
# DataFrame.shape return the tuple representation in which first element is row and second element is column.
df4.shape # this is will return total numbers of rows and columns respectively

(4, 3)

Q6. Which function of pandas do we use to read an excel file?

In [30]:
# inorder to read the excel file we have to use the pd.read_excel()

df5=pd.read_excel("excel_file.xlsx")

In [32]:
df5.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,Datetimes in LUSID,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,This sheet allows you to format datetimes for...,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,If you have any questions please visit our:,NaN,NaN,NaN,NaN,NaN,NaN

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [49]:
import pandas as pd

data={
    "Email":["vishalcr@gmail.com","pwskills@gmail.com","datascience@gmail.com"]
}
df6=pd.DataFrame(data)

In [50]:
df6

                   Email
0     vishalcr@gmail.com
1     pwskills@gmail.com
2  datascience@gmail.com

In [51]:
def username(x):
    return x.split('@')[0]

In [52]:
df6["user_name"]=df6["Email"].apply(username)

In [53]:
df6

                   Email    user_name
0     vishalcr@gmail.com     vishalcr
1     pwskills@gmail.com     pwskills
2  datascience@gmail.com  datascience

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:

   A   B   C

  3   5   1

  8   2   7

  6   9   4

  2   3   5

  9   1   2

In [4]:
import pandas as pd

data={
    "A":[3,8,6,2,9],
    "B":[5,2,9,3,1],
    "C":[1,7,4,5,2]
}
df7=pd.DataFrame(data)

In [5]:
df7

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [15]:
def select(df):
    df8=df7[(df7['A']>5)&(df7['B']<10)]
    return df8

In [18]:
select(df7)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [31]:
import pandas as pd

data={
    'Values':[1,2,3,4,5,6,7,8,9,10]
}

df9=pd.DataFrame(data)

In [32]:
df9

   Values
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9
9      10

In [40]:
def calculate(df):
    mean=df.mean()
    median=df.median() 
    standard_deviation=df.std()
    return mean,median,standard_deviation

In [42]:
calculate(df9)

(Values    5.5
 dtype: float64,
 Values    5.5
 dtype: float64,
 Values    3.02765
 dtype: float64)

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [62]:
import pandas as pd
data={
    "Sales":[23,4546,34,67,645,345,1234],
    "date":pd.date_range(start='2023-04-23', periods=7)
    
}
df10=pd.DataFrame(data)

In [69]:
def average(df):
    df["Moving_average"]=df["Sales"].rolling(window=7, min_periods=1).mean()

In [70]:
average(df10)

In [71]:
df10

   Sales       date  Moving_average
0     23 2023-04-23       23.000000
1   4546 2023-04-24     2284.500000
2     34 2023-04-25     1534.333333
3     67 2023-04-26     1167.500000
4    645 2023-04-27     1063.000000
5    345 2023-04-28      943.333333
6   1234 2023-04-29      984.857143

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:

         Date

0  2023-01-01

1  2023-01-02

2  2023-01-03

3  2023-01-04

4  2023-01-05

Your function should create the following DataFrame:


         Date    Weekday

0  2023-01-01    Sunday

1  2023-01-02     Monday

2  2023-01-03    Tuesday

3  2023-01-04    Wednesday

4  2023-01-05    Thursday

The function should return the modified DataFrame.

In [72]:
import pandas as pd
data={
    "Date":pd.date_range(start='2023-01-01',periods=7)
}
df11=pd.DataFrame(data)

In [73]:
df11

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
5 2023-01-06
6 2023-01-07

In [78]:
def day(df):
    df['Date']=pd.to_datetime(df['Date'])
    df["WeekDay"]=df['Date'].dt.day_name()
    return df

In [79]:
day(df11)

        Date    WeekDay
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday
5 2023-01-06     Friday
6 2023-01-07   Saturday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [99]:
import pandas as pd
data={
    'Date':["2023-01-01","2023-02-01","2023-03-01","2023-01-23","2023-01-24","2023-01-11","2023-05-23"],
    'Values':[1,2,3,4,5,6,7]
}

df11=pd.DataFrame(data)
df11

         Date  Values
0  2023-01-01       1
1  2023-02-01       2
2  2023-03-01       3
3  2023-01-23       4
4  2023-01-24       5
5  2023-01-11       6
6  2023-05-23       7

In [100]:
def time(df):
    df["Date"]=pd.to_datetime(df["Date"])
    df=df[(df["Date"]>="2023-01-01")&(df["Date"]>="2023-01-31")]
    return df

In [101]:
time(df11)

        Date  Values
1 2023-02-01       2
2 2023-03-01       3
6 2023-05-23       7

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [ ]:
# the fisrt and foremost necessary library that is pandas libra